r0bobo/fish-cheat
r0bobo/fish-emacs
laughedelic/fish_logo
fisherman/fzf
r0bobo/fish-fzf-z
laughedelic/pisces
rafaelrinaldi/pure
r0bobo/fish-tmux-switcher
oh-my-fish/plugin-vcs
fisherman/z
